VisibleConditions.m_conditions
Mapping of condition key and current filtering.

VisibleConditions.getAllConditions
Accessor to the current conditions.
Returns: reference to the internal conditions cache, to update/query from.

VisibleConditions
Defines "conditions" keyed by name and filter value to be used
for filtering various bits of UI in the Ribbon/Appmenu and QAT. A value of
true will allow the UI to be shown, false hides the item.